biiitech/arduino-nRF5/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.chip=Chip
menu.softdevice=Softdevice
menu.version=Version
menu.lfclk=Low Frequency Clock
menu.board_variant=Board Variant

# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=sandeepmistry:openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=sandeepmistry:openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.extra_flags=-DNRF52833_XXAA
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld

Generic_nRF52833.menu.softdevice.none=None
Generic_nRF52833.menu.softdevice.none.softdevice=none
Generic_nRF52833.menu.softdevice.none.softdeviceversion=

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT


BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=sandeepmistry:openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;
BBCmicrobitV2.upload.use_1200bps_touch=false
BBCmicrobitV2.upload.wait_for_upload_port=false
BBCmicrobitV2.upload.native_usb=false

BBCmicrobitV2.bootloader.tool=sandeepmistry:openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.extra_flags=-DNRF52833_XXAA
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld

BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT

BBCmicrobitV2.menu.softdevice.none=None
BBCmicrobitV2.menu.softdevice.none.softdevice=none
BBCmicrobitV2.menu.softdevice.none.softdeviceversion=


# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52

Generic_nRF52832.upload.tool=sandeepmistry:openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=sandeepmistry:openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=16000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.extra_flags=-DNRF52
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld

Generic_nRF52832.menu.softdevice.none=None
Generic_nRF52832.menu.softdevice.none.softdevice=none
Generic_nRF52832.menu.softdevice.none.softdeviceversion=

Generic_nRF52832.menu.softdevice.s132=S132
Generic_nRF52832.menu.softdevice.s132.softdevice=s132
Generic_nRF52832.menu.softdevice.s132.softdeviceversion=2.0.1
Generic_nRF52832.menu.softdevice.s132.upload.maximum_size=409600
Generic_nRF52832.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
Generic_nRF52832.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT



bluey.name=Electronut labs bluey

bluey.upload.tool=sandeepmistry:openocd
bluey.upload.target=nrf52
bluey.upload.maximum_size=524288

bluey.bootloader.tool=sandeepmistry:openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=16000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.extra_flags=-DNRF52
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld

bluey.menu.softdevice.none=None
bluey.menu.softdevice.none.softdevice=none
bluey.menu.softdevice.none.softdeviceversion=

bluey.menu.softdevice.s132=S132
bluey.menu.softdevice.s132.softdevice=s132
bluey.menu.softdevice.s132.softdeviceversion=2.0.1
bluey.menu.softdevice.s132.upload.maximum_size=409600
bluey.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
bluey.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld

bluey.menu.lfclk.lfxo=Crystal Oscillator
bluey.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
bluey.menu.lfclk.lfrc=RC Oscillator
bluey.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
bluey.menu.lfclk.lfsynt=Synthesized
bluey.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT



hackaBLE.name=Electronut labs hackaBLE

hackaBLE.upload.tool=sandeepmistry:openocd
hackaBLE.upload.target=nrf52
hackaBLE.upload.maximum_size=524288

hackaBLE.bootloader.tool=sandeepmistry:openocd

