biiitech/arduino-nRF5/boards.txt
STCT_nRF52_minidev.bootloader.tool=sandeepmistry:openocd

STCT_nRF52_minidev.build.mcu=cortex-m4
STCT_nRF52_minidev.build.f_cpu=16000000
STCT_nRF52_minidev.build.board=STCT_NRF52_minidev
STCT_nRF52_minidev.build.core=nRF5
STCT_nRF52_minidev.build.variant=Taida_Century_nRF52_minidev
STCT_nRF52_minidev.build.variant_system_lib=
STCT_nRF52_minidev.build.extra_flags=-DNRF52
STCT_nRF52_minidev.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
STCT_nRF52_minidev.build.ldscript=nrf52_xxaa.ld

STCT_nRF52_minidev.build.lfclk_flags=-DUSE_LFXO

STCT_nRF52_minidev.menu.softdevice.none=None
STCT_nRF52_minidev.menu.softdevice.none.softdevice=none
STCT_nRF52_minidev.menu.softdevice.none.softdeviceversion=

STCT_nRF52_minidev.menu.softdevice.s132=S132
STCT_nRF52_minidev.menu.softdevice.s132.softdevice=s132
STCT_nRF52_minidev.menu.softdevice.s132.softdeviceversion=2.0.1
STCT_nRF52_minidev.menu.softdevice.s132.upload.maximum_size=409600
STCT_nRF52_minidev.menu.softdevice.s132.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
STCT_nRF52_minidev.menu.softdevice.s132.build.ldscript=armgcc_s132_nrf52832_xxaa.ld


# nRF51 variants
###################

Generic_nRF51822.name=Generic nRF51

Generic_nRF51822.upload.tool=sandeepmistry:openocd
Generic_nRF51822.upload.target=nrf51
Generic_nRF51822.upload.maximum_size=262144

Generic_nRF51822.bootloader.tool=sandeepmistry:openocd

Generic_nRF51822.build.mcu=cortex-m0
Generic_nRF51822.build.f_cpu=16000000
Generic_nRF51822.build.board=GENERIC
Generic_nRF51822.build.core=nRF5
Generic_nRF51822.build.variant=Generic
Generic_nRF51822.build.variant_system_lib=
Generic_nRF51822.build.extra_flags=-DNRF51
Generic_nRF51822.build.float_flags=
Generic_nRF51822.build.ldscript=nrf51_{build.chip}.ld

Generic_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Generic_nRF51822.menu.chip.xxaa.build.chip=xxaa
Generic_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Generic_nRF51822.menu.chip.xxac.build.chip=xxac

Generic_nRF51822.menu.softdevice.none=None
Generic_nRF51822.menu.softdevice.none.softdevice=none
Generic_nRF51822.menu.softdevice.none.softdeviceversion=

Generic_nRF51822.menu.softdevice.s110=S110
Generic_nRF51822.menu.softdevice.s110.softdevice=s110
Generic_nRF51822.menu.softdevice.s110.softdeviceversion=8.0.0
Generic_nRF51822.menu.softdevice.s110.upload.maximum_size=151552
Generic_nRF51822.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
Generic_nRF51822.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_{build.chip}.ld

Generic_nRF51822.menu.softdevice.s130=S130
Generic_nRF51822.menu.softdevice.s130.softdevice=s130
Generic_nRF51822.menu.softdevice.s130.softdeviceversion=2.0.1
Generic_nRF51822.menu.softdevice.s130.upload.maximum_size=151552
Generic_nRF51822.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
Generic_nRF51822.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_{build.chip}.ld

Generic_nRF51822.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF51822.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822.menu.lfclk.lfrc=RC Oscillator
Generic_nRF51822.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822.menu.lfclk.lfsynt=Synthesized
Generic_nRF51822.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

BBCmicrobit.name=BBC micro:bit

BBCmicrobit.vid.0=0x0d28
BBCmicrobit.pid.0=0x0204

BBCmicrobit.upload.tool=sandeepmistry:openocd
BBCmicrobit.upload.protocol=cmsis-dap
BBCmicrobit.upload.target=nrf51
BBCmicrobit.upload.maximum_size=262144
BBCmicrobit.upload.setup_command=transport select swd;
BBCmicrobit.upload.use_1200bps_touch=false
BBCmicrobit.upload.wait_for_upload_port=false
BBCmicrobit.upload.native_usb=false

BBCmicrobit.bootloader.tool=sandeepmistry:openocd

BBCmicrobit.build.mcu=cortex-m0
BBCmicrobit.build.f_cpu=16000000
BBCmicrobit.build.board=BBC_MICROBIT
BBCmicrobit.build.core=nRF5
BBCmicrobit.build.variant=BBCmicrobit
BBCmicrobit.build.variant_system_lib=
BBCmicrobit.build.extra_flags=-DNRF51
BBCmicrobit.build.float_flags=
BBCmicrobit.build.ldscript=nrf51_xxaa.ld

BBCmicrobit.build.lfclk_flags=-DUSE_LFRC

BBCmicrobit.menu.softdevice.none=None
BBCmicrobit.menu.softdevice.none.softdevice=none
BBCmicrobit.menu.softdevice.none.softdeviceversion=

BBCmicrobit.menu.softdevice.s110=S110
BBCmicrobit.menu.softdevice.s110.softdevice=s110
BBCmicrobit.menu.softdevice.s110.softdeviceversion=8.0.0
BBCmicrobit.menu.softdevice.s110.upload.maximum_size=151552
BBCmicrobit.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
BBCmicrobit.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

BBCmicrobit.menu.softdevice.s130=S130
BBCmicrobit.menu.softdevice.s130.softdevice=s130
BBCmicrobit.menu.softdevice.s130.softdeviceversion=2.0.1
BBCmicrobit.menu.softdevice.s130.upload.maximum_size=151552
BBCmicrobit.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BBCmicrobit.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

CalliopeMini.name=Calliope mini

CalliopeMini.vid.0=0x0d28
CalliopeMini.pid.0=0x0204

CalliopeMini.upload.tool=sandeepmistry:openocd
CalliopeMini.upload.protocol=cmsis-dap
CalliopeMini.upload.target=nrf51
CalliopeMini.upload.maximum_size=262144
CalliopeMini.upload.setup_command=transport select swd;
CalliopeMini.upload.use_1200bps_touch=false
CalliopeMini.upload.wait_for_upload_port=false
CalliopeMini.upload.native_usb=false

CalliopeMini.bootloader.tool=sandeepmistry:openocd

CalliopeMini.build.mcu=cortex-m0
CalliopeMini.build.f_cpu=16000000
CalliopeMini.build.board=CALLIOPE_MINI
CalliopeMini.build.core=nRF5
CalliopeMini.build.variant=CalliopeMini
CalliopeMini.build.variant_system_lib=
CalliopeMini.build.extra_flags=-DNRF51
CalliopeMini.build.float_flags=
CalliopeMini.build.ldscript=nrf51_xxaa.ld

CalliopeMini.build.lfclk_flags=-DUSE_LFRC

CalliopeMini.menu.softdevice.none=None
CalliopeMini.menu.softdevice.none.softdevice=none
CalliopeMini.menu.softdevice.none.softdeviceversion=

CalliopeMini.menu.softdevice.s110=S110
CalliopeMini.menu.softdevice.s110.softdevice=s110
CalliopeMini.menu.softdevice.s110.softdeviceversion=8.0.0
CalliopeMini.menu.softdevice.s110.upload.maximum_size=151552
CalliopeMini.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
CalliopeMini.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

CalliopeMini.menu.softdevice.s130=S130
CalliopeMini.menu.softdevice.s130.softdevice=s130
CalliopeMini.menu.softdevice.s130.softdeviceversion=2.0.1
CalliopeMini.menu.softdevice.s130.upload.maximum_size=151552
CalliopeMini.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
CalliopeMini.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

