biiitech/arduino-nRF5/boards.txt
CalliopeminiV3.name=Calliope mini V3

CalliopeminiV3.vid.0=0x0d28
CalliopeminiV3.pid.0=0x0204

CalliopeminiV3.upload.tool=sandeepmistry:openocd
CalliopeminiV3.upload.protocol=cmsis-dap
CalliopeminiV3.upload.target=nrf52
CalliopeminiV3.upload.maximum_size=524288
CalliopeminiV3.upload.setup_command=transport select swd;
CalliopeminiV3.upload.use_1200bps_touch=false
CalliopeminiV3.upload.wait_for_upload_port=false
CalliopeminiV3.upload.native_usb=false

CalliopeminiV3.bootloader.tool=sandeepmistry:openocd

CalliopeminiV3.build.mcu=cortex-m4
CalliopeminiV3.build.f_cpu=64000000
CalliopeminiV3.build.board=CALLIOPE_MINI_V3
CalliopeminiV3.build.core=nRF5
CalliopeminiV3.build.variant=CalliopeminiV3
CalliopeminiV3.build.variant_system_lib=
CalliopeminiV3.build.extra_flags=-DNRF52833_XXAA
CalliopeminiV3.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
CalliopeminiV3.build.ldscript=nrf52833_xxaa.ld

CalliopeminiV3.build.lfclk_flags=-DUSE_LFSYNT

CalliopeminiV3.menu.softdevice.none=None
CalliopeminiV3.menu.softdevice.none.softdevice=none
CalliopeminiV3.menu.softdevice.none.softdeviceversion=

BluzDK.name=Bluz DK

BluzDK.upload.tool=sandeepmistry:openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=sandeepmistry:openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BLUZ_DK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.extra_flags=-DNRF51
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_xxac.ld

BluzDK.build.lfclk_flags=-DUSE_LFXO

BluzDK.menu.softdevice.none=None
BluzDK.menu.softdevice.none.softdevice=none
BluzDK.menu.softdevice.none.softdeviceversion=

BluzDK.menu.softdevice.s110=S110
BluzDK.menu.softdevice.s110.softdevice=s110
BluzDK.menu.softdevice.s110.softdeviceversion=8.0.0
BluzDK.menu.softdevice.s110.upload.maximum_size=151552
BluzDK.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
BluzDK.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxac.ld

BluzDK.menu.softdevice.s130=S130
BluzDK.menu.softdevice.s130.softdevice=s130
BluzDK.menu.softdevice.s130.softdeviceversion=2.0.1
BluzDK.menu.softdevice.s130.upload.maximum_size=151552
BluzDK.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BluzDK.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxac.ld


PCA1000X.name=Nordic nRF51X22 Development Kit(PCA1000X)

PCA1000X.upload.tool=sandeepmistry:openocd
PCA1000X.upload.target=nrf51
PCA1000X.upload.maximum_size=262144

PCA1000X.bootloader.tool=sandeepmistry:openocd

PCA1000X.build.mcu=cortex-m0
PCA1000X.build.f_cpu=16000000
PCA1000X.build.board=PCA1000X
PCA1000X.build.core=nRF5
PCA1000X.build.variant=PCA1000X
PCA1000X.build.variant_system_lib=
PCA1000X.build.extra_flags=-DNRF51 -D{board.variant}
PCA1000X.build.float_flags=
PCA1000X.build.ldscript=nrf51_xxaa.ld

PCA1000X.build.lfclk_flags=-DUSE_LFXO

PCA1000X.upload.tool=sandeepmistry:openocd
PCA1000X.upload.protocol=jlink
PCA1000X.upload.target=nrf51
PCA1000X.upload.maximum_size=262144
PCA1000X.upload.setup_command=transport select swd; set WORKAREASIZE 0;

PCA1000X.menu.board_variant.pca10000=PCA10000
PCA1000X.menu.board_variant.pca10000.board.variant=PCA10000
PCA1000X.menu.board_variant.pca10001=PCA10001
PCA1000X.menu.board_variant.pca10001.board.variant=PCA10001
PCA1000X.menu.board_variant.nrf6310=PCA1000X (via nRF6310)
PCA1000X.menu.board_variant.nrf6310.board.variant=NRF6310

PCA1000X.menu.softdevice.none=None
PCA1000X.menu.softdevice.none.softdevice=none
PCA1000X.menu.softdevice.none.softdeviceversion=

PCA1000X.menu.softdevice.s110=S110
PCA1000X.menu.softdevice.s110.softdevice=s110
PCA1000X.menu.softdevice.s110.softdeviceversion=8.0.0
PCA1000X.menu.softdevice.s110.upload.maximum_size=151552
PCA1000X.menu.softdevice.s110.build.extra_flags=-DNRF51 -D{board.variant} -DS110 -DNRF51_S110
PCA1000X.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

PCA1000X.menu.softdevice.s130=S130
PCA1000X.menu.softdevice.s130.softdevice=s130
PCA1000X.menu.softdevice.s130.softdeviceversion=2.0.1
PCA1000X.menu.softdevice.s130.upload.maximum_size=151552
PCA1000X.menu.softdevice.s130.build.extra_flags=-DNRF51 -D{board.variant} -DS130 -DNRF51_S130
PCA1000X.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

PCA1000X.menu.lfclk.lfxo=Crystal Oscillator
PCA1000X.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
PCA1000X.menu.lfclk.lfrc=RC Oscillator
PCA1000X.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
PCA1000X.menu.lfclk.lfsynt=Synthesized
PCA1000X.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT


nRF51Dongle.name= Nordic nRF51 Dongle (PCA10031)

nRF51Dongle.upload.tool=sandeepmistry:openocd
nRF51Dongle.upload.protocol=cmsis-dap
nRF51Dongle.upload.target=nrf51
nRF51Dongle.upload.maximum_size=262144
nRF51Dongle.upload.setup_command=transport select swd;

nRF51Dongle.bootloader.tool=sandeepmistry:openocd

nRF51Dongle.build.mcu=cortex-m0
nRF51Dongle.build.f_cpu=16000000
nRF51Dongle.build.board=GENERIC
nRF51Dongle.build.core=nRF5
nRF51Dongle.build.variant=nRF51Dongle
nRF51Dongle.build.variant_system_lib=
nRF51Dongle.build.extra_flags=-DNRF51
nRF51Dongle.build.float_flags=
nRF51Dongle.build.ldscript=nrf51_{build.chip}.ld

nRF51Dongle.build.lfclk_flags=-DUSE_LFXO

nRF51Dongle.menu.version.1_1_0=1.1.0
nRF51Dongle.menu.version.1_1_0.build.chip=xxac

nRF51Dongle.menu.softdevice.none=None
nRF51Dongle.menu.softdevice.none.softdevice=none
nRF51Dongle.menu.softdevice.none.softdeviceversion=

nRF51Dongle.menu.softdevice.s110=S110
nRF51Dongle.menu.softdevice.s110.softdevice=s110
nRF51Dongle.menu.softdevice.s110.softdeviceversion=8.0.0
nRF51Dongle.menu.softdevice.s110.upload.maximum_size=151552
nRF51Dongle.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
nRF51Dongle.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_{build.chip}.ld

nRF51Dongle.menu.softdevice.s130=S130
nRF51Dongle.menu.softdevice.s130.softdevice=s130
nRF51Dongle.menu.softdevice.s130.softdeviceversion=2.0.1
nRF51Dongle.menu.softdevice.s130.upload.maximum_size=151552
nRF51Dongle.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
nRF51Dongle.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_{build.chip}.ld

