biiitech/arduino-nRF5/boards.txt
Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=sandeepmistry:openocd
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.maximum_size=262144

Beacon_PCA20006.bootloader.tool=sandeepmistry:openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BOARD_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.extra_flags=-DNRF51
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_xxaa.ld

Beacon_PCA20006.build.lfclk_flags=-DUSE_LFXO

Beacon_PCA20006.menu.softdevice.none=None
Beacon_PCA20006.menu.softdevice.none.softdevice=none
Beacon_PCA20006.menu.softdevice.none.softdeviceversion=

Beacon_PCA20006.menu.softdevice.s110=S110
Beacon_PCA20006.menu.softdevice.s110.softdevice=s110
Beacon_PCA20006.menu.softdevice.s110.softdeviceversion=8.0.0
Beacon_PCA20006.menu.softdevice.s110.upload.maximum_size=151552
Beacon_PCA20006.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
Beacon_PCA20006.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

Beacon_PCA20006.menu.softdevice.s130=S130
Beacon_PCA20006.menu.softdevice.s130.softdevice=s130
Beacon_PCA20006.menu.softdevice.s130.softdeviceversion=2.0.1
Beacon_PCA20006.menu.softdevice.s130.upload.maximum_size=151552
Beacon_PCA20006.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
Beacon_PCA20006.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld

TinyBLE.name= TinyBLE

TinyBLE.upload.tool=sandeepmistry:openocd
TinyBLE.upload.protocol=cmsis-dap

TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144
TinyBLE.upload.setup_command=transport select swd;

TinyBLE.bootloader.tool=sandeepmistry:openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.extra_flags=-DNRF51
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_xxaa.ld

TinyBLE.build.lfclk_flags=-DUSE_LFXO

TinyBLE.menu.softdevice.none=None
TinyBLE.menu.softdevice.none.softdevice=none
TinyBLE.menu.softdevice.none.softdeviceversion=

TinyBLE.menu.softdevice.s110=S110
TinyBLE.menu.softdevice.s110.softdevice=s110
TinyBLE.menu.softdevice.s110.softdeviceversion=8.0.0
TinyBLE.menu.softdevice.s110.upload.maximum_size=151552
TinyBLE.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
TinyBLE.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxaa.ld

TinyBLE.menu.softdevice.s130=S130
TinyBLE.menu.softdevice.s130.softdevice=s130
TinyBLE.menu.softdevice.s130.softdeviceversion=2.0.1
TinyBLE.menu.softdevice.s130.upload.maximum_size=151552
TinyBLE.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
TinyBLE.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxaa.ld


OSHChip.name=OSHChip

OSHChip.upload.tool=sandeepmistry:openocd
OSHChip.upload.target=nrf51
OSHChip.upload.maximum_size=262144

OSHChip.bootloader.tool=sandeepmistry:openocd

OSHChip.build.mcu=cortex-m0
OSHChip.build.f_cpu=16000000
OSHChip.build.board=BLUZ_DK
OSHChip.build.core=nRF5
OSHChip.build.variant=OSHChip
OSHChip.build.variant_system_lib=
OSHChip.build.extra_flags=-DNRF51
OSHChip.build.float_flags=
OSHChip.build.ldscript=nrf51_xxac.ld

OSHChip.build.lfclk_flags=-DUSE_LFRC

OSHChip.menu.softdevice.none=None
OSHChip.menu.softdevice.none.softdevice=none
OSHChip.menu.softdevice.none.softdeviceversion=

OSHChip.menu.softdevice.s110=S110
OSHChip.menu.softdevice.s110.softdevice=s110
OSHChip.menu.softdevice.s110.softdeviceversion=8.0.0
OSHChip.menu.softdevice.s110.upload.maximum_size=151552
OSHChip.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
OSHChip.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_xxac.ld

OSHChip.menu.softdevice.s130=S130
OSHChip.menu.softdevice.s130.softdevice=s130
OSHChip.menu.softdevice.s130.softdeviceversion=2.0.1
OSHChip.menu.softdevice.s130.upload.maximum_size=151552
OSHChip.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
OSHChip.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_xxac.ld


BLENano.name=RedBearLab BLE Nano

BLENano.upload.tool=sandeepmistry:openocd
BLENano.upload.protocol=cmsis-dap
BLENano.upload.target=nrf51
BLENano.upload.maximum_size=262144
BLENano.upload.setup_command=transport select swd;

BLENano.bootloader.tool=sandeepmistry:openocd

BLENano.build.mcu=cortex-m0
BLENano.build.f_cpu=16000000
BLENano.build.board=BLE_NANO
BLENano.build.core=nRF5
BLENano.build.variant=BLENano
BLENano.build.variant_system_lib=
BLENano.build.extra_flags=-DNRF51
BLENano.build.float_flags=
BLENano.build.ldscript=nrf51_{build.chip}.ld

BLENano.build.lfclk_flags=-DUSE_LFXO

BLENano.menu.version.1_0=1.0
BLENano.menu.version.1_0.build.chip=xxaa
BLENano.menu.version.1_5=1.5
BLENano.menu.version.1_5.build.chip=xxac

BLENano.menu.softdevice.none=None
BLENano.menu.softdevice.none.softdevice=none
BLENano.menu.softdevice.none.softdeviceversion=

BLENano.menu.softdevice.s110=S110
BLENano.menu.softdevice.s110.softdevice=s110
BLENano.menu.softdevice.s110.softdeviceversion=8.0.0
BLENano.menu.softdevice.s110.upload.maximum_size=151552
BLENano.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
BLENano.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_{build.chip}.ld

BLENano.menu.softdevice.s130=S130
BLENano.menu.softdevice.s130.softdevice=s130
BLENano.menu.softdevice.s130.softdeviceversion=2.0.1
BLENano.menu.softdevice.s130.upload.maximum_size=151552
BLENano.menu.softdevice.s130.build.extra_flags=-DNRF51 -DS130 -DNRF51_S130
BLENano.menu.softdevice.s130.build.ldscript=armgcc_s130_nrf51822_{build.chip}.ld


RedBearLab_nRF51822.name=RedBearLab nRF51822

RedBearLab_nRF51822.upload.tool=sandeepmistry:openocd
RedBearLab_nRF51822.upload.protocol=cmsis-dap
RedBearLab_nRF51822.upload.target=nrf51
RedBearLab_nRF51822.upload.maximum_size=262144
RedBearLab_nRF51822.upload.setup_command=transport select swd;

RedBearLab_nRF51822.bootloader.tool=sandeepmistry:openocd

RedBearLab_nRF51822.build.mcu=cortex-m0
RedBearLab_nRF51822.build.f_cpu=16000000
RedBearLab_nRF51822.build.board=REDBEARLAB_NRF51822
RedBearLab_nRF51822.build.core=nRF5
RedBearLab_nRF51822.build.variant=RedBearLab_nRF51822
RedBearLab_nRF51822.build.variant_system_lib=
RedBearLab_nRF51822.build.extra_flags=-DNRF51
RedBearLab_nRF51822.build.float_flags=
RedBearLab_nRF51822.build.ldscript=nrf51_{build.chip}.ld

RedBearLab_nRF51822.build.lfclk_flags=-DUSE_LFXO

RedBearLab_nRF51822.menu.version.1_0=1.0
RedBearLab_nRF51822.menu.version.1_0.build.chip=xxaa
RedBearLab_nRF51822.menu.version.1_5=1.5
RedBearLab_nRF51822.menu.version.1_5.build.chip=xxac

RedBearLab_nRF51822.menu.softdevice.none=None
RedBearLab_nRF51822.menu.softdevice.none.softdevice=none
RedBearLab_nRF51822.menu.softdevice.none.softdeviceversion=

RedBearLab_nRF51822.menu.softdevice.s110=S110
RedBearLab_nRF51822.menu.softdevice.s110.softdevice=s110
RedBearLab_nRF51822.menu.softdevice.s110.softdeviceversion=8.0.0
RedBearLab_nRF51822.menu.softdevice.s110.upload.maximum_size=151552
RedBearLab_nRF51822.menu.softdevice.s110.build.extra_flags=-DNRF51 -DS110 -DNRF51_S110
RedBearLab_nRF51822.menu.softdevice.s110.build.ldscript=armgcc_s110_nrf51822_{build.chip}.ld

